import type {NpcScriptDataProps} from 'type';

export const scriptPionart : NpcScriptDataProps = {
    visit : '저는 마그 멜을 지키는 일을 하고 있는 이 중 하나입니다. 일종의 상인 역할을 하고 있죠. 어떻게 보일 지 모르겠지만, 영광스러운 소임이라고 생각해요.',
    buy : '나무가 가지 뻗듯, 뿌리가 내려 박히듯 당신께도 언제고 뻗어 나갈 길이 있길 바랄게요.',    
    sell : '그대 내딛는 모든 걸음에 새소리와 함께 새순같은 기쁨이 움트길 기원하겠습니다.',
    leave : '언제고 한 줌의 호기심과 희망이 당신의 내면에 머물길 바랄게요.',
    normal01 : '제가 일종의 잡화상이라고 볼 수 있겠네요. 필요한 물건이 있으시다면 거래를 요청해주세요.',
    normal02 : '마그 멜은 휴식을 취하기에 적합한 땅입니다. 느끼기에 따라 조금 소란스럽게 여기실 수도 있겠지만요.',
    normal03 : '이곳에서는 제가 일종의 상인 역할을 하고 있어요. 원하시는 것이 이곳에 있을 지 모르겠네요. 혹은 제가 원하는 걸 가지고 계신 걸까요?',
    normal04 : '준비된 것이 많지는 않을 거예요. 바깥 세상에서 쓰이는 많은 것들이 이곳에서는 쓸모가 없기 때문이죠. 혹시 금박 솔방울을 얻으셨다면 적당한 물건으로 교환해 드릴게요. 그건 모두가 아주 좋아하는 물건이거든요.',
    normal05 : '이곳은 마그 멜입니다. 여왕님이 다스리는 땅 중 일부이지요. 마그 멜은 이 땅만을 뜻하는 것은 아니에요. 본래는 시오라 님의 손길이 닿는 모든 요정의 땅을 의미한답니다.',
    normal06 : '과거에는 황금빛 밭과 들판도 펼쳐져 있었어요. 어느 요정이 벌인 일이었죠. 꽤나 아름다웠는데, 마그 멜이 작아지며 사라졌네요.',
    normal07 : '지금의 마그 멜은 과거와는 다르답니다. 마을로 가는 문들이 많이 사라졌죠. 물론 언제든 다시 생길 수 있겠지만요.',
    normal08 : '제 이름은 피오나트입니다. 이름으로 자신을 소개할 자격을 갖췄지요. 대단한 것은 아니지만, 의미있는 일이에요.',
}